data/perf/stageB-d3bf9f8c39fe/memcached-10k/tsan-swmr/run1/memtier.txt
10        Threads
50        Connections per thread
10000     Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       240492.49          ---          ---         3.99223         3.72700        10.23900        13.82300     16408.43 
Gets      2402282.09         0.00   2402282.09         3.91650         3.64700        10.04700        13.63100     60735.55 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2642774.58         0.00   2402282.09         3.92339         3.66300        10.04700        13.69500     77143.98 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       167134.40          ---          ---         4.26646         3.96700        11.00700        14.84700     11403.32 
Gets      1669507.34         0.00   1669507.34         4.19068         3.88700        10.81500        14.71900     42209.22 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1836641.74         0.00   1669507.34         4.19758         3.90300        10.81500        14.71900     53612.54 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       205567.55          ---          ---         4.12420         3.85500        10.87900        15.23100     14025.56 
Gets      2053416.52         0.00   2053416.52         4.04813         3.77500        10.62300        15.03900     51915.38 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2258984.07         0.00   2053416.52         4.05506         3.79100        10.68700        15.03900     65940.94